# 交换机和路由器基础

## 交换机基础

### 什么是交换机
交换机（Switch）是工作在数据链路层的网络设备，它能够根据MAC地址表智能地转发数据帧，实现局域网内设备的高效通信。

### 交换机的工作原理
1. **学习**：记录源MAC地址和对应端口
2. **转发**：根据目标MAC地址查找端口并转发
3. **泛洪**：未知目标MAC时向所有端口广播
4. **过滤**：同一网段内通信不向其他网段转发

### 交换机的功能特点
- **MAC地址学习**：自动学习并维护MAC地址表
- **智能转发**：基于MAC地址进行点对点转发
- **冲突域隔离**：每个端口都是独立的冲突域
- **广播域共享**：所有端口属于同一广播域
- **全双工通信**：支持同时收发数据

### 交换机类型
- **二层交换机**：工作在数据链路层
- **三层交换机**：具有路由功能的多层交换机
- **管理型交换机**：支持VLAN、QoS等高级功能
- **非管理型交换机**：即插即用，功能简单

## 路由器基础

### 什么是路由器
路由器（Router）是工作在网络层的设备，它能够根据路由表在不同网络之间转发数据包，实现跨网段通信。

### 路由器的工作原理
1. **接收数据包**：从接口接收数据包
2. **查找路由表**：根据目标IP查找最佳路径
3. **转发数据包**：将数据包转发到下一跳
4. **更新路由表**：通过路由协议学习网络拓扑

### 路由器的功能特点
- **网络层转发**：基于IP地址进行路由决策
- **广播域隔离**：每个接口都是独立的广播域
- **路径选择**：选择最优路径转发数据
- **协议转换**：支持不同网络协议的转换
- **安全控制**：提供访问控制和防火墙功能

### 路由器类型
- **企业级路由器**：高性能，功能丰富
- **家用路由器**：集成交换机和无线功能
- **核心路由器**：用于骨干网络
- **边缘路由器**：用于网络边界

## VLAN技术

### 什么是VLAN
VLAN（Virtual Local Area Network）是虚拟局域网技术，它能够将一个物理网络逻辑地划分为多个独立的广播域。

### VLAN的优势
- **广播控制**：限制广播域范围
- **安全性**：隔离不同VLAN的通信
- **灵活性**：不受物理位置限制
- **管理简化**：便于网络管理和维护

### VLAN配置

#### 创建VLAN
```cisco
Switch(config)# vlan 10
Switch(config-vlan)# name Sales
Switch(config-vlan)# exit

Switch(config)# vlan 20
Switch(config-vlan)# name Marketing
Switch(config-vlan)# exit
```

#### 分配端口到VLAN
```cisco
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# exit

Switch(config)# interface fastethernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# exit
```

#### 配置Trunk端口
```cisco
Switch(config)# interface fastethernet 0/24
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk allowed vlan 10,20
Switch(config-if)# exit
```

### VLAN间路由

#### 单臂路由（Router on a Stick）
```cisco
Router(config)# interface fastethernet 0/0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastethernet 0/0.10
Router(config-subif)# encapsulation dot1q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface fastethernet 0/0.20
Router(config-subif)# encapsulation dot1q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
Router(config-subif)# exit
```

## 路由配置

### 静态路由
静态路由是管理员手动配置的路由，适用于小型网络或特殊需求。

#### 配置静态路由
```cisco
Router(config)# ip route 192.168.2.0 255.255.255.0 192.168.1.2
Router(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.1
```

#### 查看路由表
```cisco
Router# show ip route
Router# show ip route static
```

### 动态路由

#### RIP协议配置
```cisco
Router(config)# router rip
Router(config-router)# version 2
Router(config-router)# network 192.168.1.0
Router(config-router)# network 192.168.2.0
Router(config-router)# no auto-summary
Router(config-router)# exit
```

#### OSPF协议配置
```cisco
Router(config)# router ospf 1
Router(config-router)# network 192.168.1.0 0.0.0.255 area 0
Router(config-router)# network 192.168.2.0 0.0.0.255 area 0
Router(config-router)# exit
```

## 常用配置命令

### 交换机基本命令

#### 基本配置
```cisco
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW1
SW1(config)# enable secret cisco
SW1(config)# line console 0
SW1(config-line)# password cisco
SW1(config-line)# login
SW1(config-line)# exit
```

#### 接口配置
```cisco
SW1(config)# interface fastethernet 0/1
SW1(config-if)# description "连接PC1"
SW1(config-if)# speed 100
SW1(config-if)# duplex full
SW1(config-if)# no shutdown
SW1(config-if)# exit
```

#### 查看信息
```cisco
SW1# show version
SW1# show interfaces
SW1# show mac-address-table
SW1# show vlan
SW1# show running-config
```

### 路由器基本命令

#### 基本配置
```cisco
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)# enable secret cisco
R1(config)# line console 0
R1(config-line)# password cisco
R1(config-line)# login
R1(config-line)# exit
```

#### 接口配置
```cisco
R1(config)# interface fastethernet 0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# description "连接内网"
R1(config-if)# no shutdown
R1(config-if)# exit

R1(config)# interface serial 0/0/0
R1(config-if)# ip address 10.0.0.1 255.255.255.252
R1(config-if)# clock rate 64000
R1(config-if)# no shutdown
R1(config-if)# exit
```

#### 查看信息
```cisco
R1# show version
R1# show interfaces
R1# show ip route
R1# show ip protocols
R1# show running-config
```

## 网络设计实例

### 实例1：小型办公网络
```
拓扑结构：
PC1(VLAN10) ←→ Switch ←→ PC2(VLAN20)
       ↓
    Router ←→ Internet
```

**配置要点：**
1. 交换机配置VLAN 10和VLAN 20
2. 路由器配置子接口实现VLAN间路由
3. 配置NAT实现互联网访问

### 实例2：多网段网络
```
拓扑结构：
网段1: 192.168.1.0/24 ←→ Router1 ←→ 网段2: 192.168.2.0/24
       ↓
    Router2 ←→ Internet
```

**配置要点：**
1. 配置静态路由或动态路由
2. 配置默认路由指向互联网
3. 配置NAT转换

### 实例3：冗余网络
```
拓扑结构：
PC ←→ Switch1 ←→ Router1 ←→ Internet
      ↓           ↓
    Switch2 ←→ Router2
```

**配置要点：**
1. 配置STP防止环路
2. 配置HSRP实现网关冗余
3. 配置链路聚合提高带宽

## 故障排除

### 常见问题诊断

#### 1. 设备无法通信
**检查步骤：**
```cisco
# 检查接口状态
show interfaces

# 检查IP配置
show ip interface brief

# 检查ARP表
show arp

# 测试连通性
ping 192.168.1.1
```

#### 2. VLAN间无法通信
**检查步骤：**
```cisco
# 检查VLAN配置
show vlan

# 检查Trunk配置
show interfaces trunk

# 检查路由配置
show ip route
```

#### 3. 路由不通
**检查步骤：**
```cisco
# 检查路由表
show ip route

# 检查路由协议状态
show ip protocols

# 检查邻居关系
show ip ospf neighbor
```

### 调试命令
```cisco
# 启用调试信息
debug ip packet
debug ip routing
debug ip ospf events

# 查看日志
show logging

# 清除ARP缓存
clear arp-cache

# 重新加载配置
reload
```

## 安全配置

### 访问控制列表（ACL）

#### 标准ACL
```cisco
Router(config)# access-list 10 permit 192.168.1.0 0.0.0.255
Router(config)# access-list 10 deny any
Router(config)# interface fastethernet 0/0
Router(config-if)# ip access-group 10 out
Router(config-if)# exit
```

#### 扩展ACL
```cisco
Router(config)# access-list 100 permit tcp 192.168.1.0 0.0.0.255 host 192.168.2.1 eq 80
Router(config)# access-list 100 deny ip any any
Router(config)# interface fastethernet 0/1
Router(config-if)# ip access-group 100 in
Router(config-if)# exit
```

### 端口安全
```cisco
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security violation restrict
Switch(config-if)# exit
```

## 性能优化

### 链路聚合
```cisco
Switch(config)# interface port-channel 1
Switch(config-if)# switchport mode trunk
Switch(config-if)# exit

Switch(config)# interface range fastethernet 0/1-2
Switch(config-if-range)# channel-group 1 mode on
Switch(config-if-range)# exit
```

### QoS配置
```cisco
Switch(config)# class-map VOICE
Switch(config-cmap)# match dscp ef
Switch(config-cmap)# exit

Switch(config)# policy-map QOS-POLICY
Switch(config-pmap)# class VOICE
Switch(config-pmap-c)# priority percent 30
Switch(config-pmap-c)# exit

Switch(config)# interface fastethernet 0/1
Switch(config-if)# service-policy output QOS-POLICY
Switch(config-if)# exit
```

## 监控和维护

### 系统监控
```cisco
# 查看CPU使用率
show processes cpu

# 查看内存使用情况
show memory

# 查看接口统计
show interfaces counters

# 查看系统日志
show logging
```

### 配置备份
```cisco
# 备份配置到TFTP服务器
copy running-config tftp://192.168.1.100/switch-config.txt

# 备份配置到本地
copy running-config startup-config

# 查看配置差异
show archive config differences
```

### 固件升级
```cisco
# 查看当前版本
show version

# 下载新固件
copy tftp://192.168.1.100/c2960-lanbasek9-mz.150-2.SE11.bin flash:

# 设置启动文件
boot system flash:c2960-lanbasek9-mz.150-2.SE11.bin

# 重启设备
reload
```

## 最佳实践

### 1. 配置管理
- 使用有意义的设备命名
- 添加接口描述信息
- 定期备份配置文件
- 使用版本控制管理配置

### 2. 安全配置
- 设置强密码
- 启用SSH替代Telnet
- 配置访问控制列表
- 定期更新固件

### 3. 网络设计
- 合理规划IP地址
- 使用VLAN隔离广播域
- 配置冗余链路
- 考虑可扩展性

### 4. 故障预防
- 监控设备状态
- 设置告警机制
- 定期检查日志
- 制定应急预案

## 学习建议

### 1. 理论学习
- 理解OSI模型各层功能
- 掌握网络协议工作原理
- 学习路由和交换算法
- 了解网络安全技术

### 2. 实践操作
- 使用Packet Tracer进行实验
- 配置真实设备
- 分析网络流量
- 解决实际问题

### 3. 持续学习
- 关注新技术发展
- 参加技术培训
- 获得相关认证
- 参与技术社区

### 4. 经验积累
- 记录实验过程
- 总结故障案例
- 分享学习心得
- 建立知识库
